program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.9.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp16, [1, 3, 512, 960]> img0, tensor<fp16, [1, 3, 512, 960]> img1, tensor<fp16, [1, 1, 1, 1]> time_step) {
            tensor<int32, [8]> x_1_pad_0 = const()[name = tensor<string, []>("x_1_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<string, []> x_1_mode_0 = const()[name = tensor<string, []>("x_1_mode_0"), val = tensor<string, []>("reflect")];
            tensor<fp16, []> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 514, 962]> x_1_cast_fp16 = pad(constant_val = const_3_to_fp16, mode = x_1_mode_0, pad = x_1_pad_0, x = img0)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<string, []> x_3_pad_type_0 = const()[name = tensor<string, []>("x_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_3_strides_0 = const()[name = tensor<string, []>("x_3_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> x_3_groups_0 = const()[name = tensor<string, []>("x_3_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> x_3_pad_0 = const()[name = tensor<string, []>("x_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_3_dilations_0 = const()[name = tensor<string, []>("x_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [3, 1, 1, 3]> downsampler_kernel_h_to_fp16 = const()[name = tensor<string, []>("downsampler_kernel_h_to_fp16"), val = tensor<fp16, [3, 1, 1, 3]>([[[[0x1p-2, 0x1p-1, 0x1p-2]]], [[[0x1p-2, 0x1p-1, 0x1p-2]]], [[[0x1p-2, 0x1p-1, 0x1p-2]]]])];
            tensor<fp16, [1, 3, 514, 480]> x_3_cast_fp16 = conv(dilations = x_3_dilations_0, groups = x_3_groups_0, pad = x_3_pad_0, pad_type = x_3_pad_type_0, strides = x_3_strides_0, weight = downsampler_kernel_h_to_fp16, x = x_1_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [2]>([2, 1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [3, 1, 3, 1]> downsampler_kernel_v_to_fp16 = const()[name = tensor<string, []>("downsampler_kernel_v_to_fp16"), val = tensor<fp16, [3, 1, 3, 1]>([[[[0x1p-2], [0x1p-1], [0x1p-2]]], [[[0x1p-2], [0x1p-1], [0x1p-2]]], [[[0x1p-2], [0x1p-1], [0x1p-2]]]])];
            tensor<fp16, [1, 3, 256, 480]> input_1_cast_fp16 = conv(dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = downsampler_kernel_v_to_fp16, x = x_3_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [8]> x_5_pad_0 = const()[name = tensor<string, []>("x_5_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<string, []> x_5_mode_0 = const()[name = tensor<string, []>("x_5_mode_0"), val = tensor<string, []>("reflect")];
            tensor<fp16, []> const_4_to_fp16 = const()[name = tensor<string, []>("const_4_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 514, 962]> x_5_cast_fp16 = pad(constant_val = const_4_to_fp16, mode = x_5_mode_0, pad = x_5_pad_0, x = img1)[name = tensor<string, []>("x_5_cast_fp16")];
            tensor<string, []> x_7_pad_type_0 = const()[name = tensor<string, []>("x_7_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_7_strides_0 = const()[name = tensor<string, []>("x_7_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> x_7_groups_0 = const()[name = tensor<string, []>("x_7_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> x_7_pad_0 = const()[name = tensor<string, []>("x_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_7_dilations_0 = const()[name = tensor<string, []>("x_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 514, 480]> x_7_cast_fp16 = conv(dilations = x_7_dilations_0, groups = x_7_groups_0, pad = x_7_pad_0, pad_type = x_7_pad_type_0, strides = x_7_strides_0, weight = downsampler_kernel_h_to_fp16, x = x_5_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_3_strides_0 = const()[name = tensor<string, []>("input_3_strides_0"), val = tensor<int32, [2]>([2, 1])];
            tensor<int32, []> input_3_groups_0 = const()[name = tensor<string, []>("input_3_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_3_dilations_0 = const()[name = tensor<string, []>("input_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 256, 480]> input_3_cast_fp16 = conv(dilations = input_3_dilations_0, groups = input_3_groups_0, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = input_3_strides_0, weight = downsampler_kernel_v_to_fp16, x = x_7_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [8]> x_9_pad_0 = const()[name = tensor<string, []>("x_9_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<string, []> x_9_mode_0 = const()[name = tensor<string, []>("x_9_mode_0"), val = tensor<string, []>("reflect")];
            tensor<fp16, []> const_5_to_fp16 = const()[name = tensor<string, []>("const_5_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 258, 482]> x_9_cast_fp16 = pad(constant_val = const_5_to_fp16, mode = x_9_mode_0, pad = x_9_pad_0, x = input_1_cast_fp16)[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<string, []> x_11_pad_type_0 = const()[name = tensor<string, []>("x_11_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_11_strides_0 = const()[name = tensor<string, []>("x_11_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> x_11_groups_0 = const()[name = tensor<string, []>("x_11_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> x_11_pad_0 = const()[name = tensor<string, []>("x_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_11_dilations_0 = const()[name = tensor<string, []>("x_11_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 258, 240]> x_11_cast_fp16 = conv(dilations = x_11_dilations_0, groups = x_11_groups_0, pad = x_11_pad_0, pad_type = x_11_pad_type_0, strides = x_11_strides_0, weight = downsampler_kernel_h_to_fp16, x = x_9_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_5_strides_0 = const()[name = tensor<string, []>("input_5_strides_0"), val = tensor<int32, [2]>([2, 1])];
            tensor<int32, []> input_5_groups_0 = const()[name = tensor<string, []>("input_5_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_5_dilations_0 = const()[name = tensor<string, []>("input_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 128, 240]> input_5_cast_fp16 = conv(dilations = input_5_dilations_0, groups = input_5_groups_0, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = input_5_strides_0, weight = downsampler_kernel_v_to_fp16, x = x_11_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [8]> x_13_pad_0 = const()[name = tensor<string, []>("x_13_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<string, []> x_13_mode_0 = const()[name = tensor<string, []>("x_13_mode_0"), val = tensor<string, []>("reflect")];
            tensor<fp16, []> const_6_to_fp16 = const()[name = tensor<string, []>("const_6_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 258, 482]> x_13_cast_fp16 = pad(constant_val = const_6_to_fp16, mode = x_13_mode_0, pad = x_13_pad_0, x = input_3_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<string, []> x_15_pad_type_0 = const()[name = tensor<string, []>("x_15_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_15_strides_0 = const()[name = tensor<string, []>("x_15_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> x_15_groups_0 = const()[name = tensor<string, []>("x_15_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> x_15_pad_0 = const()[name = tensor<string, []>("x_15_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_15_dilations_0 = const()[name = tensor<string, []>("x_15_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 258, 240]> x_15_cast_fp16 = conv(dilations = x_15_dilations_0, groups = x_15_groups_0, pad = x_15_pad_0, pad_type = x_15_pad_type_0, strides = x_15_strides_0, weight = downsampler_kernel_h_to_fp16, x = x_13_cast_fp16)[name = tensor<string, []>("x_15_cast_fp16")];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_7_strides_0 = const()[name = tensor<string, []>("input_7_strides_0"), val = tensor<int32, [2]>([2, 1])];
            tensor<int32, []> input_7_groups_0 = const()[name = tensor<string, []>("input_7_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_7_dilations_0 = const()[name = tensor<string, []>("input_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 128, 240]> input_7_cast_fp16 = conv(dilations = input_7_dilations_0, groups = input_7_groups_0, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = input_7_strides_0, weight = downsampler_kernel_v_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [8]> x_17_pad_0 = const()[name = tensor<string, []>("x_17_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<string, []> x_17_mode_0 = const()[name = tensor<string, []>("x_17_mode_0"), val = tensor<string, []>("reflect")];
            tensor<fp16, []> const_7_to_fp16 = const()[name = tensor<string, []>("const_7_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 130, 242]> x_17_cast_fp16 = pad(constant_val = const_7_to_fp16, mode = x_17_mode_0, pad = x_17_pad_0, x = input_5_cast_fp16)[name = tensor<string, []>("x_17_cast_fp16")];
            tensor<string, []> x_19_pad_type_0 = const()[name = tensor<string, []>("x_19_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_19_strides_0 = const()[name = tensor<string, []>("x_19_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> x_19_groups_0 = const()[name = tensor<string, []>("x_19_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> x_19_pad_0 = const()[name = tensor<string, []>("x_19_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_19_dilations_0 = const()[name = tensor<string, []>("x_19_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 130, 120]> x_19_cast_fp16 = conv(dilations = x_19_dilations_0, groups = x_19_groups_0, pad = x_19_pad_0, pad_type = x_19_pad_type_0, strides = x_19_strides_0, weight = downsampler_kernel_h_to_fp16, x = x_17_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<string, []> img0_pad_type_0 = const()[name = tensor<string, []>("img0_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> img0_strides_0 = const()[name = tensor<string, []>("img0_strides_0"), val = tensor<int32, [2]>([2, 1])];
            tensor<int32, []> img0_groups_0 = const()[name = tensor<string, []>("img0_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> img0_pad_0 = const()[name = tensor<string, []>("img0_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> img0_dilations_0 = const()[name = tensor<string, []>("img0_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 64, 120]> img0_cast_fp16 = conv(dilations = img0_dilations_0, groups = img0_groups_0, pad = img0_pad_0, pad_type = img0_pad_type_0, strides = img0_strides_0, weight = downsampler_kernel_v_to_fp16, x = x_19_cast_fp16)[name = tensor<string, []>("img0_cast_fp16")];
            tensor<int32, [8]> x_21_pad_0 = const()[name = tensor<string, []>("x_21_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 1, 1, 1])];
            tensor<string, []> x_21_mode_0 = const()[name = tensor<string, []>("x_21_mode_0"), val = tensor<string, []>("reflect")];
            tensor<fp16, []> const_8_to_fp16 = const()[name = tensor<string, []>("const_8_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 130, 242]> x_21_cast_fp16 = pad(constant_val = const_8_to_fp16, mode = x_21_mode_0, pad = x_21_pad_0, x = input_7_cast_fp16)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<string, []> x_23_pad_type_0 = const()[name = tensor<string, []>("x_23_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_23_strides_0 = const()[name = tensor<string, []>("x_23_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> x_23_groups_0 = const()[name = tensor<string, []>("x_23_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> x_23_pad_0 = const()[name = tensor<string, []>("x_23_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_23_dilations_0 = const()[name = tensor<string, []>("x_23_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 130, 120]> x_23_cast_fp16 = conv(dilations = x_23_dilations_0, groups = x_23_groups_0, pad = x_23_pad_0, pad_type = x_23_pad_type_0, strides = x_23_strides_0, weight = downsampler_kernel_h_to_fp16, x = x_21_cast_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<string, []> img1_pad_type_0 = const()[name = tensor<string, []>("img1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> img1_strides_0 = const()[name = tensor<string, []>("img1_strides_0"), val = tensor<int32, [2]>([2, 1])];
            tensor<int32, []> img1_groups_0 = const()[name = tensor<string, []>("img1_groups_0"), val = tensor<int32, []>(3)];
            tensor<int32, [4]> img1_pad_0 = const()[name = tensor<string, []>("img1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> img1_dilations_0 = const()[name = tensor<string, []>("img1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [1, 3, 64, 120]> img1_cast_fp16 = conv(dilations = img1_dilations_0, groups = img1_groups_0, pad = img1_pad_0, pad_type = img1_pad_type_0, strides = img1_strides_0, weight = downsampler_kernel_v_to_fp16, x = x_23_cast_fp16)[name = tensor<string, []>("img1_cast_fp16")];
            tensor<int32, [1]> squeeze_0_axes_0 = const()[name = tensor<string, []>("squeeze_0_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 1, 1]> squeeze_0_cast_fp16 = squeeze(axes = squeeze_0_axes_0, x = time_step)[name = tensor<string, []>("squeeze_0_cast_fp16")];
            tensor<int32, []> var_183 = const()[name = tensor<string, []>("op_183"), val = tensor<int32, []>(0)];
            tensor<bool, []> input_9_interleave_0 = const()[name = tensor<string, []>("input_9_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 3, 64, 120]> input_9_cast_fp16 = concat(axis = var_183, interleave = input_9_interleave_0, values = (img0_cast_fp16, img1_cast_fp16))[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<uint32, []> input_11_downscale_factor_0 = const()[name = tensor<string, []>("input_11_downscale_factor_0"), val = tensor<uint32, []>(2)];
            tensor<fp16, [2, 12, 32, 60]> input_11_cast_fp16 = pixel_unshuffle(downscale_factor = input_11_downscale_factor_0, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 12, 3, 3]> mfe_conv_weight_to_fp16 = const()[name = tensor<string, []>("mfe_conv_weight_to_fp16"), val = tensor<fp16, [32, 12, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> mfe_conv_bias_to_fp16 = const()[name = tensor<string, []>("mfe_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7040)))];
            tensor<fp16, [2, 32, 32, 60]> input_13_cast_fp16 = conv(bias = mfe_conv_bias_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = mfe_conv_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, []> var_188_to_fp16 = const()[name = tensor<string, []>("op_188_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 32, 60]> input_15_cast_fp16 = instance_norm(epsilon = var_188_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_17_strides_0 = const()[name = tensor<string, []>("input_17_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_17_dilations_0 = const()[name = tensor<string, []>("input_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_17_groups_0 = const()[name = tensor<string, []>("input_17_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> mfe_layer0_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("mfe_layer0_0_conv1_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7168)))];
            tensor<fp16, [32]> mfe_layer0_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("mfe_layer0_0_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25664)))];
            tensor<fp16, [2, 32, 32, 60]> input_17_cast_fp16 = conv(bias = mfe_layer0_0_conv1_bias_to_fp16, dilations = input_17_dilations_0, groups = input_17_groups_0, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = input_17_strides_0, weight = mfe_layer0_0_conv1_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, []> var_185_to_fp16 = const()[name = tensor<string, []>("op_185_to_fp16"), val = tensor<fp16, []>(0x1.47cp-7)];
            tensor<fp16, [2, 32, 32, 60]> input_19_cast_fp16 = leaky_relu(alpha = var_185_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [2, 32, 32, 60]> input_21_cast_fp16 = instance_norm(epsilon = var_188_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<string, []> input_23_pad_type_0 = const()[name = tensor<string, []>("input_23_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_23_pad_0 = const()[name = tensor<string, []>("input_23_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_23_strides_0 = const()[name = tensor<string, []>("input_23_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_23_dilations_0 = const()[name = tensor<string, []>("input_23_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_23_groups_0 = const()[name = tensor<string, []>("input_23_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> mfe_layer0_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("mfe_layer0_0_conv2_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25792)))];
            tensor<fp16, [32]> mfe_layer0_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("mfe_layer0_0_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44288)))];
            tensor<fp16, [2, 32, 32, 60]> input_23_cast_fp16 = conv(bias = mfe_layer0_0_conv2_bias_to_fp16, dilations = input_23_dilations_0, groups = input_23_groups_0, pad = input_23_pad_0, pad_type = input_23_pad_type_0, strides = input_23_strides_0, weight = mfe_layer0_0_conv2_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [2, 32, 32, 60]> out_1_cast_fp16 = leaky_relu(alpha = var_185_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [2, 32, 32, 60]> input_25_cast_fp16 = add(x = out_1_cast_fp16, y = input_13_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<string, []> input_27_pad_type_0 = const()[name = tensor<string, []>("input_27_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_27_strides_0 = const()[name = tensor<string, []>("input_27_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_27_pad_0 = const()[name = tensor<string, []>("input_27_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_27_dilations_0 = const()[name = tensor<string, []>("input_27_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_27_groups_0 = const()[name = tensor<string, []>("input_27_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 32, 2, 2]> mfe_layer1_0_weight_to_fp16 = const()[name = tensor<string, []>("mfe_layer1_0_weight_to_fp16"), val = tensor<fp16, [64, 32, 2, 2]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44416)))];
            tensor<fp16, [64]> mfe_layer1_0_bias_to_fp16 = const()[name = tensor<string, []>("mfe_layer1_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60864)))];
            tensor<fp16, [2, 64, 16, 30]> input_27_cast_fp16 = conv(bias = mfe_layer1_0_bias_to_fp16, dilations = input_27_dilations_0, groups = input_27_groups_0, pad = input_27_pad_0, pad_type = input_27_pad_type_0, strides = input_27_strides_0, weight = mfe_layer1_0_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> input_29_cast_fp16 = instance_norm(epsilon = var_188_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<string, []> input_31_pad_type_0 = const()[name = tensor<string, []>("input_31_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_31_pad_0 = const()[name = tensor<string, []>("input_31_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_31_strides_0 = const()[name = tensor<string, []>("input_31_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_31_dilations_0 = const()[name = tensor<string, []>("input_31_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_31_groups_0 = const()[name = tensor<string, []>("input_31_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> mfe_layer1_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("mfe_layer1_1_conv1_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61056)))];
            tensor<fp16, [64]> mfe_layer1_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("mfe_layer1_1_conv1_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134848)))];
            tensor<fp16, [2, 64, 16, 30]> input_31_cast_fp16 = conv(bias = mfe_layer1_1_conv1_bias_to_fp16, dilations = input_31_dilations_0, groups = input_31_groups_0, pad = input_31_pad_0, pad_type = input_31_pad_type_0, strides = input_31_strides_0, weight = mfe_layer1_1_conv1_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> input_33_cast_fp16 = leaky_relu(alpha = var_185_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> input_35_cast_fp16 = instance_norm(epsilon = var_188_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_37_strides_0 = const()[name = tensor<string, []>("input_37_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_37_dilations_0 = const()[name = tensor<string, []>("input_37_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_37_groups_0 = const()[name = tensor<string, []>("input_37_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> mfe_layer1_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("mfe_layer1_1_conv2_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135040)))];
            tensor<fp16, [64]> mfe_layer1_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("mfe_layer1_1_conv2_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(208832)))];
            tensor<fp16, [2, 64, 16, 30]> input_37_cast_fp16 = conv(bias = mfe_layer1_1_conv2_bias_to_fp16, dilations = input_37_dilations_0, groups = input_37_groups_0, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = input_37_strides_0, weight = mfe_layer1_1_conv2_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> out_3_cast_fp16 = leaky_relu(alpha = var_185_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("out_3_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> input_39_cast_fp16 = add(x = out_3_cast_fp16, y = input_27_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_41_strides_0 = const()[name = tensor<string, []>("input_41_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_41_dilations_0 = const()[name = tensor<string, []>("input_41_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_41_groups_0 = const()[name = tensor<string, []>("input_41_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 2, 2]> mfe_layer2_0_weight_to_fp16 = const()[name = tensor<string, []>("mfe_layer2_0_weight_to_fp16"), val = tensor<fp16, [128, 64, 2, 2]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(209024)))];
            tensor<fp16, [128]> mfe_layer2_0_bias_to_fp16 = const()[name = tensor<string, []>("mfe_layer2_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(274624)))];
            tensor<fp16, [2, 128, 8, 15]> input_41_cast_fp16 = conv(bias = mfe_layer2_0_bias_to_fp16, dilations = input_41_dilations_0, groups = input_41_groups_0, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = input_41_strides_0, weight = mfe_layer2_0_weight_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<fp16, [2, 128, 8, 15]> input_43_cast_fp16 = instance_norm(epsilon = var_188_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_45_strides_0 = const()[name = tensor<string, []>("input_45_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_45_dilations_0 = const()[name = tensor<string, []>("input_45_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_45_groups_0 = const()[name = tensor<string, []>("input_45_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 3, 3]> mfe_layer2_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("mfe_layer2_1_conv1_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(274944)))];
            tensor<fp16, [128]> mfe_layer2_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("mfe_layer2_1_conv1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(569920)))];
            tensor<fp16, [2, 128, 8, 15]> input_45_cast_fp16 = conv(bias = mfe_layer2_1_conv1_bias_to_fp16, dilations = input_45_dilations_0, groups = input_45_groups_0, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = input_45_strides_0, weight = mfe_layer2_1_conv1_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<fp16, [2, 128, 8, 15]> input_47_cast_fp16 = leaky_relu(alpha = var_185_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [2, 128, 8, 15]> input_49_cast_fp16 = instance_norm(epsilon = var_188_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<string, []> input_51_pad_type_0 = const()[name = tensor<string, []>("input_51_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_51_pad_0 = const()[name = tensor<string, []>("input_51_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_51_strides_0 = const()[name = tensor<string, []>("input_51_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_51_dilations_0 = const()[name = tensor<string, []>("input_51_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_51_groups_0 = const()[name = tensor<string, []>("input_51_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 3, 3]> mfe_layer2_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("mfe_layer2_1_conv2_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(570240)))];
            tensor<fp16, [128]> mfe_layer2_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("mfe_layer2_1_conv2_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(865216)))];
            tensor<fp16, [2, 128, 8, 15]> input_51_cast_fp16 = conv(bias = mfe_layer2_1_conv2_bias_to_fp16, dilations = input_51_dilations_0, groups = input_51_groups_0, pad = input_51_pad_0, pad_type = input_51_pad_type_0, strides = input_51_strides_0, weight = mfe_layer2_1_conv2_weight_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [2, 128, 8, 15]> out_5_cast_fp16 = leaky_relu(alpha = var_185_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("out_5_cast_fp16")];
            tensor<fp16, [2, 128, 8, 15]> input_53_cast_fp16 = add(x = out_5_cast_fp16, y = input_41_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<string, []> feat_3_pad_type_0 = const()[name = tensor<string, []>("feat_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> feat_3_pad_0 = const()[name = tensor<string, []>("feat_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> feat_3_strides_0 = const()[name = tensor<string, []>("feat_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> feat_3_dilations_0 = const()[name = tensor<string, []>("feat_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> feat_3_groups_0 = const()[name = tensor<string, []>("feat_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 3, 3]> mfe_conv_last_weight_to_fp16 = const()[name = tensor<string, []>("mfe_conv_last_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(865536)))];
            tensor<fp16, [128]> mfe_conv_last_bias_to_fp16 = const()[name = tensor<string, []>("mfe_conv_last_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1160512)))];
            tensor<fp16, [2, 128, 8, 15]> feat_3_cast_fp16 = conv(bias = mfe_conv_last_bias_to_fp16, dilations = feat_3_dilations_0, groups = feat_3_groups_0, pad = feat_3_pad_0, pad_type = feat_3_pad_type_0, strides = feat_3_strides_0, weight = mfe_conv_last_weight_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("feat_3_cast_fp16")];
            tensor<string, []> input_57_pad_type_0 = const()[name = tensor<string, []>("input_57_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_57_pad_0 = const()[name = tensor<string, []>("input_57_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_57_strides_0 = const()[name = tensor<string, []>("input_57_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_57_dilations_0 = const()[name = tensor<string, []>("input_57_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_57_groups_0 = const()[name = tensor<string, []>("input_57_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 12, 3, 3]> cfe_conv_weight_to_fp16 = const()[name = tensor<string, []>("cfe_conv_weight_to_fp16"), val = tensor<fp16, [32, 12, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1160832)))];
            tensor<fp16, [32]> cfe_conv_bias_to_fp16 = const()[name = tensor<string, []>("cfe_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1167808)))];
            tensor<fp16, [2, 32, 32, 60]> input_57_cast_fp16 = conv(bias = cfe_conv_bias_to_fp16, dilations = input_57_dilations_0, groups = input_57_groups_0, pad = input_57_pad_0, pad_type = input_57_pad_type_0, strides = input_57_strides_0, weight = cfe_conv_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, []> var_303_to_fp16 = const()[name = tensor<string, []>("op_303_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 32, 60]> input_59_cast_fp16 = instance_norm(epsilon = var_303_to_fp16, x = input_57_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<string, []> input_61_pad_type_0 = const()[name = tensor<string, []>("input_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_61_pad_0 = const()[name = tensor<string, []>("input_61_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_61_strides_0 = const()[name = tensor<string, []>("input_61_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_61_dilations_0 = const()[name = tensor<string, []>("input_61_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_61_groups_0 = const()[name = tensor<string, []>("input_61_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> cfe_layer0_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("cfe_layer0_0_conv1_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1167936)))];
            tensor<fp16, [32]> cfe_layer0_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("cfe_layer0_0_conv1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1186432)))];
            tensor<fp16, [2, 32, 32, 60]> input_61_cast_fp16 = conv(bias = cfe_layer0_0_conv1_bias_to_fp16, dilations = input_61_dilations_0, groups = input_61_groups_0, pad = input_61_pad_0, pad_type = input_61_pad_type_0, strides = input_61_strides_0, weight = cfe_layer0_0_conv1_weight_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<fp16, []> var_300_to_fp16 = const()[name = tensor<string, []>("op_300_to_fp16"), val = tensor<fp16, []>(0x1.47cp-7)];
            tensor<fp16, [2, 32, 32, 60]> input_63_cast_fp16 = leaky_relu(alpha = var_300_to_fp16, x = input_61_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<fp16, [2, 32, 32, 60]> input_65_cast_fp16 = instance_norm(epsilon = var_303_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<string, []> input_67_pad_type_0 = const()[name = tensor<string, []>("input_67_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_67_pad_0 = const()[name = tensor<string, []>("input_67_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_67_strides_0 = const()[name = tensor<string, []>("input_67_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_67_dilations_0 = const()[name = tensor<string, []>("input_67_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_67_groups_0 = const()[name = tensor<string, []>("input_67_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> cfe_layer0_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("cfe_layer0_0_conv2_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1186560)))];
            tensor<fp16, [32]> cfe_layer0_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("cfe_layer0_0_conv2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1205056)))];
            tensor<fp16, [2, 32, 32, 60]> input_67_cast_fp16 = conv(bias = cfe_layer0_0_conv2_bias_to_fp16, dilations = input_67_dilations_0, groups = input_67_groups_0, pad = input_67_pad_0, pad_type = input_67_pad_type_0, strides = input_67_strides_0, weight = cfe_layer0_0_conv2_weight_to_fp16, x = input_65_cast_fp16)[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<fp16, [2, 32, 32, 60]> out_7_cast_fp16 = leaky_relu(alpha = var_300_to_fp16, x = input_67_cast_fp16)[name = tensor<string, []>("out_7_cast_fp16")];
            tensor<fp16, [2, 32, 32, 60]> input_69_cast_fp16 = add(x = out_7_cast_fp16, y = input_57_cast_fp16)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<string, []> input_71_pad_type_0 = const()[name = tensor<string, []>("input_71_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_71_strides_0 = const()[name = tensor<string, []>("input_71_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_71_pad_0 = const()[name = tensor<string, []>("input_71_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_71_dilations_0 = const()[name = tensor<string, []>("input_71_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_71_groups_0 = const()[name = tensor<string, []>("input_71_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 32, 2, 2]> cfe_layer1_0_weight_to_fp16 = const()[name = tensor<string, []>("cfe_layer1_0_weight_to_fp16"), val = tensor<fp16, [64, 32, 2, 2]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1205184)))];
            tensor<fp16, [64]> cfe_layer1_0_bias_to_fp16 = const()[name = tensor<string, []>("cfe_layer1_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1221632)))];
            tensor<fp16, [2, 64, 16, 30]> input_71_cast_fp16 = conv(bias = cfe_layer1_0_bias_to_fp16, dilations = input_71_dilations_0, groups = input_71_groups_0, pad = input_71_pad_0, pad_type = input_71_pad_type_0, strides = input_71_strides_0, weight = cfe_layer1_0_weight_to_fp16, x = input_69_cast_fp16)[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> input_73_cast_fp16 = instance_norm(epsilon = var_303_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<string, []> input_75_pad_type_0 = const()[name = tensor<string, []>("input_75_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_75_pad_0 = const()[name = tensor<string, []>("input_75_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_75_strides_0 = const()[name = tensor<string, []>("input_75_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_75_dilations_0 = const()[name = tensor<string, []>("input_75_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_75_groups_0 = const()[name = tensor<string, []>("input_75_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> cfe_layer1_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("cfe_layer1_1_conv1_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1221824)))];
            tensor<fp16, [64]> cfe_layer1_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("cfe_layer1_1_conv1_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1295616)))];
            tensor<fp16, [2, 64, 16, 30]> input_75_cast_fp16 = conv(bias = cfe_layer1_1_conv1_bias_to_fp16, dilations = input_75_dilations_0, groups = input_75_groups_0, pad = input_75_pad_0, pad_type = input_75_pad_type_0, strides = input_75_strides_0, weight = cfe_layer1_1_conv1_weight_to_fp16, x = input_73_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> input_77_cast_fp16 = leaky_relu(alpha = var_300_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> input_79_cast_fp16 = instance_norm(epsilon = var_303_to_fp16, x = input_77_cast_fp16)[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<string, []> input_81_pad_type_0 = const()[name = tensor<string, []>("input_81_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_81_pad_0 = const()[name = tensor<string, []>("input_81_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_81_strides_0 = const()[name = tensor<string, []>("input_81_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_81_dilations_0 = const()[name = tensor<string, []>("input_81_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_81_groups_0 = const()[name = tensor<string, []>("input_81_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> cfe_layer1_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("cfe_layer1_1_conv2_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1295808)))];
            tensor<fp16, [64]> cfe_layer1_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("cfe_layer1_1_conv2_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1369600)))];
            tensor<fp16, [2, 64, 16, 30]> input_81_cast_fp16 = conv(bias = cfe_layer1_1_conv2_bias_to_fp16, dilations = input_81_dilations_0, groups = input_81_groups_0, pad = input_81_pad_0, pad_type = input_81_pad_type_0, strides = input_81_strides_0, weight = cfe_layer1_1_conv2_weight_to_fp16, x = input_79_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> out_9_cast_fp16 = leaky_relu(alpha = var_300_to_fp16, x = input_81_cast_fp16)[name = tensor<string, []>("out_9_cast_fp16")];
            tensor<fp16, [2, 64, 16, 30]> input_83_cast_fp16 = add(x = out_9_cast_fp16, y = input_71_cast_fp16)[name = tensor<string, []>("input_83_cast_fp16")];
            tensor<string, []> input_85_pad_type_0 = const()[name = tensor<string, []>("input_85_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_85_strides_0 = const()[name = tensor<string, []>("input_85_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_85_pad_0 = const()[name = tensor<string, []>("input_85_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_85_dilations_0 = const()[name = tensor<string, []>("input_85_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_85_groups_0 = const()[name = tensor<string, []>("input_85_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 2, 2]> cfe_layer2_0_weight_to_fp16 = const()[name = tensor<string, []>("cfe_layer2_0_weight_to_fp16"), val = tensor<fp16, [128, 64, 2, 2]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1369792)))];
            tensor<fp16, [128]> cfe_layer2_0_bias_to_fp16 = const()[name = tensor<string, []>("cfe_layer2_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1435392)))];
